tests/Load/basic.yaml
reporting:
    -   module: passfail
        criteria:
            - avg-rt >200ms

execution:
    -   executor: gatling
        scenario: php
        concurrency: 4000
        ramp-up: 5s
        hold-for: 30s
    -   executor: gatling
        scenario: go
        concurrency: 4000
        ramp-up: 5s
        hold-for: 30s

scenarios:
    php:
        default-address: php:8080
        requests:
            -   url: /
                headers:
                    Accept: application/json
                method: POST
                body-file: basic-request.json
    go:
        default-address: go:8090
        requests:
            -   url: /ping
                method: GET